export default function HistoryS() {
    return(
        <section className='containerSecond historyBegin'>
            <h2 className='neon'>История</h2>
            <p><strong>Происхождение шахмат</strong><br/>
                <strong>Древний Индийский чатуранга</strong><br/>
                Шахматы имеют свои корни в древней Индии, где в VI веке была разработана игра под названием "чатуранга".
                Это слово означает "четыре войска" и отражает основные элементы игры: пехоту, кавалерию, слонов и
                колесницы. Чатуранга играли на доске с квадратной сеткой, и в ней могли участвовать до четырех игроков,
                что отличало её от современных шахмат.<br/><br/>

                <strong>Шатрандж в Персии</strong><br/>
                Игра распространилась в Персию, где она получила название "шатрандж". Здесь правила игры начали
                эволюционировать, и появились фигуры, которые стали основой для современных шахмат. Например,
                фигура, которая сейчас называется ферзем, была менее мощной и называлась "вазир". Шатрандж стало
                популярной игрой среди аристократии и интеллигенции, и многие персидские литературные произведения
                упоминают о ней.<br/><br/>

                <strong>Арабский мир и Европа</strong><br/>

                <strong>Распространение через арабский мир</strong><br/>
                После арабских завоеваний шахматы попали в арабский мир, где они стали невероятно популярными. Арабы
                внесли изменения в правила и фигуры, что сделало игру более увлекательной. В IX-X веках шахматы стали
                известны в арабском мире, и многие арабские ученые начали писать трактаты о стратегии и тактике
                игры.<br/><br/>

                <strong>Приход в Европу</strong><br/>
                Шахматы прибыли в Европу через Испанию и Италию в IX веке. Первые упоминания о шахматах в европейских
                источниках относятся к этому времени. К XII веку игра стала популярной среди европейской аристократии.
                В течение Средневековья правила продолжали изменяться, и к XV веку были установлены современные правила,
                включая движение ферзя и слона, что сделало игру более динамичной.<br/><br/>

                <strong>Ренессанс и развитие шахмат</strong><br/>

                <strong>Шахматы в эпоху Ренессанса</strong><br/>
                С начала XVI века шахматы стали неотъемлемой частью культурной жизни Европы. Появились первые шахматные
                книги, такие как "Книга о шахматах" Луиджи Керрери, и началась эпоха шахматной теории. Игроки стали
                изучать стратегии и тактики, а также разрабатывать новые приемы.<br/><br/>

                <strong>Шахматные турниры </strong><br/>
                В XVII-XVIII веках начали проводиться первые шахматные турниры, что стало важным шагом к организации
                шахматного сообщества. В 1851 году в Лондоне прошел первый международный шахматный турнир, который
                выиграл Адольф Андерсен. Это событие привлекло внимание к шахматам как к серьезному виду
                спорта.<br/><br/>

                <strong>19 век: Золотой век шахмат</strong><br/>

                <strong>Появление чемпионов</strong><br/>
                В 19 веке шахматы стали международным явлением. Появились такие выдающиеся игроки, как Исаак Левитский,
                Пол Морфи и Вильгельм Стейниц. Стейниц стал первым официальным чемпионом мира в 1886 году, установив
                стандарты для будущих чемпионатов.<br/><br/>

                <strong>Шахматные ассоциации</strong><br/>
                В 1883 году была основана первая шахматная ассоциация, а в 1924 году прошли первые международные
                шахматные олимпиады. Эти события способствовали популяризации шахмат и расширению их
                аудитории.<br/><br/>

                <strong>20 век: Эра великих мастеров</strong><br/>

                <strong>Михаил Ботвинник и советская школа</strong><br/>
                В середине 20 века шахматы стали неотъемлемой частью советской культуры. Михаил Ботвинник, ставший
                чемпионом мира в 1948 году, разработал систему подготовки шахматистов, которая включала теоретические
                исследования и практические тренировки. Советские игроки, такие как Анатолий Карпов и Гарри Каспаров,
                доминировали в международной шахматной арене.<br/><br/>

                <strong>Компьютеры и шахматы</strong><br/>
                С конца 20 века шахматы начали активно использовать компьютеры для анализа партий и разработки
                стратегий.
                В 1997 году компьютер "Дип Блу" победил чемпиона мира Гарри Каспарова, что стало знаковым событием в
                истории шахмат и технологий.<br/><br/>

                <strong>21 век: Шахматы в цифровую эпоху</strong><br/>

                <strong>Онлайн-шахматы</strong><br/>

                С развитием интернета шахматы стали доступны для игроков по всему миру. Появление онлайн-платформ,
                таких как Chess.com и Lichess, позволило миллионам людей играть, учиться и соревноваться в шахматах.
                Это привело к новому всплеску интереса к игре и развитию шахматной культуры.<br/><br/>

                <strong>Шахматы как спорт и искусство</strong><br/>

                Сегодня шахматы воспринимаются не только как игра, но и как искусство и наука. Они способствуют развитию
                стратегического мышления, терпения и концентрации. Шахматы также стали популярными в образовательных
                учреждениях, где их используют для обучения детей.<br/><br/>

                <strong>Заключение</strong><br/>

                Шахматы прошли долгий путь от своих древних корней до современности, став одной из самых популярных и
                уважаемых игр в мире. Они продолжают развиваться, привлекая новое поколение игроков и зрителей, и
                остаются важным культурным и интеллектуальным явлением.
            </p>
        </section>
    )
}